----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]           1,792
       BatchNorm2d-2         [-1, 64, 224, 224]             128
              ReLU-3         [-1, 64, 224, 224]               0
            Conv2d-4         [-1, 64, 224, 224]          36,928
       BatchNorm2d-5         [-1, 64, 224, 224]             128
              ReLU-6         [-1, 64, 224, 224]               0
       double_conv-7         [-1, 64, 224, 224]               0
            inconv-8         [-1, 64, 224, 224]               0
         MaxPool2d-9         [-1, 64, 112, 112]               0
           Conv2d-10        [-1, 128, 112, 112]          73,856
      BatchNorm2d-11        [-1, 128, 112, 112]             256
             ReLU-12        [-1, 128, 112, 112]               0
           Conv2d-13        [-1, 128, 112, 112]         147,584
      BatchNorm2d-14        [-1, 128, 112, 112]             256
             ReLU-15        [-1, 128, 112, 112]               0
      double_conv-16        [-1, 128, 112, 112]               0
             down-17        [-1, 128, 112, 112]               0
        MaxPool2d-18          [-1, 128, 56, 56]               0
           Conv2d-19          [-1, 256, 56, 56]         295,168
      BatchNorm2d-20          [-1, 256, 56, 56]             512
             ReLU-21          [-1, 256, 56, 56]               0
           Conv2d-22          [-1, 256, 56, 56]         590,080
      BatchNorm2d-23          [-1, 256, 56, 56]             512
             ReLU-24          [-1, 256, 56, 56]               0
      double_conv-25          [-1, 256, 56, 56]               0
             down-26          [-1, 256, 56, 56]               0
        MaxPool2d-27          [-1, 256, 28, 28]               0
           Conv2d-28          [-1, 512, 28, 28]       1,180,160
      BatchNorm2d-29          [-1, 512, 28, 28]           1,024
             ReLU-30          [-1, 512, 28, 28]               0
           Conv2d-31          [-1, 512, 28, 28]       2,359,808
      BatchNorm2d-32          [-1, 512, 28, 28]           1,024
             ReLU-33          [-1, 512, 28, 28]               0
      double_conv-34          [-1, 512, 28, 28]               0
             down-35          [-1, 512, 28, 28]               0
        MaxPool2d-36          [-1, 512, 14, 14]               0
           Conv2d-37          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-38          [-1, 512, 14, 14]           1,024
             ReLU-39          [-1, 512, 14, 14]               0
           Conv2d-40          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-41          [-1, 512, 14, 14]           1,024
             ReLU-42          [-1, 512, 14, 14]               0
      double_conv-43          [-1, 512, 14, 14]               0
             down-44          [-1, 512, 14, 14]               0
         Upsample-45          [-1, 512, 28, 28]               0
           Conv2d-46          [-1, 256, 28, 28]       2,359,552
      BatchNorm2d-47          [-1, 256, 28, 28]             512
             ReLU-48          [-1, 256, 28, 28]               0
           Conv2d-49          [-1, 256, 28, 28]         590,080
      BatchNorm2d-50          [-1, 256, 28, 28]             512
             ReLU-51          [-1, 256, 28, 28]               0
      double_conv-52          [-1, 256, 28, 28]               0
               up-53          [-1, 256, 28, 28]               0
         Upsample-54          [-1, 256, 56, 56]               0
           Conv2d-55          [-1, 128, 56, 56]         589,952
      BatchNorm2d-56          [-1, 128, 56, 56]             256
             ReLU-57          [-1, 128, 56, 56]               0
           Conv2d-58          [-1, 128, 56, 56]         147,584
      BatchNorm2d-59          [-1, 128, 56, 56]             256
             ReLU-60          [-1, 128, 56, 56]               0
      double_conv-61          [-1, 128, 56, 56]               0
               up-62          [-1, 128, 56, 56]               0
         Upsample-63        [-1, 128, 112, 112]               0
           Conv2d-64         [-1, 64, 112, 112]         147,520
      BatchNorm2d-65         [-1, 64, 112, 112]             128
             ReLU-66         [-1, 64, 112, 112]               0
           Conv2d-67         [-1, 64, 112, 112]          36,928
      BatchNorm2d-68         [-1, 64, 112, 112]             128
             ReLU-69         [-1, 64, 112, 112]               0
      double_conv-70         [-1, 64, 112, 112]               0
               up-71         [-1, 64, 112, 112]               0
         Upsample-72         [-1, 64, 224, 224]               0
           Conv2d-73         [-1, 64, 224, 224]          73,792
      BatchNorm2d-74         [-1, 64, 224, 224]             128
             ReLU-75         [-1, 64, 224, 224]               0
           Conv2d-76         [-1, 64, 224, 224]          36,928
      BatchNorm2d-77         [-1, 64, 224, 224]             128
             ReLU-78         [-1, 64, 224, 224]               0
      double_conv-79         [-1, 64, 224, 224]               0
               up-80         [-1, 64, 224, 224]               0
           Conv2d-81          [-1, 1, 224, 224]              65
          outconv-82          [-1, 1, 224, 224]               0

================================================================
Total params: 13,395,329
Trainable params: 13,395,329
Non-trainable params: 0
----------------------------------------------------------------

