----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 422, 422]           1,792
              ReLU-2         [-1, 64, 422, 422]               0
            Conv2d-3         [-1, 64, 422, 422]          36,928
              ReLU-4         [-1, 64, 422, 422]               0
         MaxPool2d-5         [-1, 64, 211, 211]               0
            Conv2d-6        [-1, 128, 211, 211]          73,856
              ReLU-7        [-1, 128, 211, 211]               0
            Conv2d-8        [-1, 128, 211, 211]         147,584
              ReLU-9        [-1, 128, 211, 211]               0
        MaxPool2d-10        [-1, 128, 106, 106]               0
           Conv2d-11        [-1, 256, 106, 106]         295,168
             ReLU-12        [-1, 256, 106, 106]               0
           Conv2d-13        [-1, 256, 106, 106]         590,080
             ReLU-14        [-1, 256, 106, 106]               0
           Conv2d-15        [-1, 256, 106, 106]         590,080
             ReLU-16        [-1, 256, 106, 106]               0
        MaxPool2d-17          [-1, 256, 53, 53]               0
           Conv2d-18          [-1, 512, 53, 53]       1,180,160
             ReLU-19          [-1, 512, 53, 53]               0
           Conv2d-20          [-1, 512, 53, 53]       2,359,808
             ReLU-21          [-1, 512, 53, 53]               0
           Conv2d-22          [-1, 512, 53, 53]       2,359,808
             ReLU-23          [-1, 512, 53, 53]               0
        MaxPool2d-24          [-1, 512, 27, 27]               0
           Conv2d-25          [-1, 512, 27, 27]       2,359,808
             ReLU-26          [-1, 512, 27, 27]               0
           Conv2d-27          [-1, 512, 27, 27]       2,359,808
             ReLU-28          [-1, 512, 27, 27]               0
           Conv2d-29          [-1, 512, 27, 27]       2,359,808
             ReLU-30          [-1, 512, 27, 27]               0
        MaxPool2d-31          [-1, 512, 14, 14]               0
           Conv2d-32           [-1, 4096, 8, 8]     102,764,544
             ReLU-33           [-1, 4096, 8, 8]               0
        Dropout2d-34           [-1, 4096, 8, 8]               0
           Conv2d-35           [-1, 4096, 8, 8]      16,781,312
             ReLU-36           [-1, 4096, 8, 8]               0
        Dropout2d-37           [-1, 4096, 8, 8]               0
           Conv2d-38             [-1, 21, 8, 8]          86,037
  ConvTranspose2d-39           [-1, 21, 18, 18]           7,056
           Conv2d-40           [-1, 21, 27, 27]          10,773
  ConvTranspose2d-41         [-1, 21, 304, 304]         451,584

================================================================
Total params: 134,815,994
Trainable params: 134,815,994
Non-trainable params: 0
----------------------------------------------------------------

