----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 128, 128]           9,472
       BatchNorm2d-2         [-1, 64, 128, 128]             128
              ReLU-3         [-1, 64, 128, 128]               0
              ReLU-4         [-1, 64, 128, 128]               0
              ReLU-5         [-1, 64, 128, 128]               0
       BatchNorm2d-6         [-1, 64, 128, 128]             128
              ReLU-7         [-1, 64, 128, 128]               0
            Conv2d-8         [-1, 64, 128, 128]           4,160
       BatchNorm2d-9         [-1, 64, 128, 128]             128
             ReLU-10         [-1, 64, 128, 128]               0
           Conv2d-11         [-1, 64, 128, 128]          36,928
      BatchNorm2d-12         [-1, 64, 128, 128]             128
             ReLU-13         [-1, 64, 128, 128]               0
           Conv2d-14        [-1, 128, 128, 128]           8,320
           Conv2d-15        [-1, 128, 128, 128]           8,320
       Bottleneck-16        [-1, 128, 128, 128]               0
      BatchNorm2d-17        [-1, 128, 128, 128]             256
             ReLU-18        [-1, 128, 128, 128]               0
           Conv2d-19        [-1, 128, 128, 128]          16,512
      BatchNorm2d-20        [-1, 128, 128, 128]             256
             ReLU-21        [-1, 128, 128, 128]               0
           Conv2d-22        [-1, 128, 128, 128]         147,584
      BatchNorm2d-23        [-1, 128, 128, 128]             256
             ReLU-24        [-1, 128, 128, 128]               0
           Conv2d-25        [-1, 256, 128, 128]          33,024
           Conv2d-26        [-1, 256, 128, 128]          33,024
       Bottleneck-27        [-1, 256, 128, 128]               0
      BatchNorm2d-28        [-1, 256, 128, 128]             512
             ReLU-29        [-1, 256, 128, 128]               0
           Conv2d-30        [-1, 128, 128, 128]          32,896
      BatchNorm2d-31        [-1, 128, 128, 128]             256
             ReLU-32        [-1, 128, 128, 128]               0
           Conv2d-33        [-1, 128, 128, 128]         147,584
      BatchNorm2d-34        [-1, 128, 128, 128]             256
             ReLU-35        [-1, 128, 128, 128]               0
           Conv2d-36        [-1, 256, 128, 128]          33,024
       Bottleneck-37        [-1, 256, 128, 128]               0
      BatchNorm2d-38        [-1, 256, 128, 128]             512
             ReLU-39        [-1, 256, 128, 128]               0
           Conv2d-40        [-1, 128, 128, 128]          32,896
      BatchNorm2d-41        [-1, 128, 128, 128]             256
             ReLU-42        [-1, 128, 128, 128]               0
           Conv2d-43        [-1, 128, 128, 128]         147,584
      BatchNorm2d-44        [-1, 128, 128, 128]             256
             ReLU-45        [-1, 128, 128, 128]               0
           Conv2d-46        [-1, 256, 128, 128]          33,024
       Bottleneck-47        [-1, 256, 128, 128]               0
      BatchNorm2d-48          [-1, 256, 64, 64]             512
             ReLU-49          [-1, 256, 64, 64]               0
           Conv2d-50          [-1, 128, 64, 64]          32,896
      BatchNorm2d-51          [-1, 128, 64, 64]             256
             ReLU-52          [-1, 128, 64, 64]               0
           Conv2d-53          [-1, 128, 64, 64]         147,584
      BatchNorm2d-54          [-1, 128, 64, 64]             256
             ReLU-55          [-1, 128, 64, 64]               0
           Conv2d-56          [-1, 256, 64, 64]          33,024
       Bottleneck-57          [-1, 256, 64, 64]               0
      BatchNorm2d-58          [-1, 256, 64, 64]             512
             ReLU-59          [-1, 256, 64, 64]               0
           Conv2d-60          [-1, 128, 64, 64]          32,896
      BatchNorm2d-61          [-1, 128, 64, 64]             256
             ReLU-62          [-1, 128, 64, 64]               0
           Conv2d-63          [-1, 128, 64, 64]         147,584
      BatchNorm2d-64          [-1, 128, 64, 64]             256
             ReLU-65          [-1, 128, 64, 64]               0
           Conv2d-66          [-1, 256, 64, 64]          33,024
       Bottleneck-67          [-1, 256, 64, 64]               0
      BatchNorm2d-68          [-1, 256, 32, 32]             512
             ReLU-69          [-1, 256, 32, 32]               0
           Conv2d-70          [-1, 128, 32, 32]          32,896
      BatchNorm2d-71          [-1, 128, 32, 32]             256
             ReLU-72          [-1, 128, 32, 32]               0
           Conv2d-73          [-1, 128, 32, 32]         147,584
      BatchNorm2d-74          [-1, 128, 32, 32]             256
             ReLU-75          [-1, 128, 32, 32]               0
           Conv2d-76          [-1, 256, 32, 32]          33,024
       Bottleneck-77          [-1, 256, 32, 32]               0
      BatchNorm2d-78          [-1, 256, 32, 32]             512
             ReLU-79          [-1, 256, 32, 32]               0
           Conv2d-80          [-1, 128, 32, 32]          32,896
      BatchNorm2d-81          [-1, 128, 32, 32]             256
             ReLU-82          [-1, 128, 32, 32]               0
           Conv2d-83          [-1, 128, 32, 32]         147,584
      BatchNorm2d-84          [-1, 128, 32, 32]             256
             ReLU-85          [-1, 128, 32, 32]               0
           Conv2d-86          [-1, 256, 32, 32]          33,024
       Bottleneck-87          [-1, 256, 32, 32]               0
      BatchNorm2d-88          [-1, 256, 16, 16]             512
             ReLU-89          [-1, 256, 16, 16]               0
           Conv2d-90          [-1, 128, 16, 16]          32,896
      BatchNorm2d-91          [-1, 128, 16, 16]             256
             ReLU-92          [-1, 128, 16, 16]               0
           Conv2d-93          [-1, 128, 16, 16]         147,584
      BatchNorm2d-94          [-1, 128, 16, 16]             256
             ReLU-95          [-1, 128, 16, 16]               0
           Conv2d-96          [-1, 256, 16, 16]          33,024
       Bottleneck-97          [-1, 256, 16, 16]               0
      BatchNorm2d-98          [-1, 256, 16, 16]             512
             ReLU-99          [-1, 256, 16, 16]               0
          Conv2d-100          [-1, 128, 16, 16]          32,896
     BatchNorm2d-101          [-1, 128, 16, 16]             256
            ReLU-102          [-1, 128, 16, 16]               0
          Conv2d-103          [-1, 128, 16, 16]         147,584
     BatchNorm2d-104          [-1, 128, 16, 16]             256
            ReLU-105          [-1, 128, 16, 16]               0
          Conv2d-106          [-1, 256, 16, 16]          33,024
      Bottleneck-107          [-1, 256, 16, 16]               0
     BatchNorm2d-108            [-1, 256, 8, 8]             512
            ReLU-109            [-1, 256, 8, 8]               0
          Conv2d-110            [-1, 128, 8, 8]          32,896
     BatchNorm2d-111            [-1, 128, 8, 8]             256
            ReLU-112            [-1, 128, 8, 8]               0
          Conv2d-113            [-1, 128, 8, 8]         147,584
     BatchNorm2d-114            [-1, 128, 8, 8]             256
            ReLU-115            [-1, 128, 8, 8]               0
          Conv2d-116            [-1, 256, 8, 8]          33,024
      Bottleneck-117            [-1, 256, 8, 8]               0
     BatchNorm2d-118            [-1, 256, 8, 8]             512
            ReLU-119            [-1, 256, 8, 8]               0
          Conv2d-120            [-1, 128, 8, 8]          32,896
     BatchNorm2d-121            [-1, 128, 8, 8]             256
            ReLU-122            [-1, 128, 8, 8]               0
          Conv2d-123            [-1, 128, 8, 8]         147,584
     BatchNorm2d-124            [-1, 128, 8, 8]             256
            ReLU-125            [-1, 128, 8, 8]               0
          Conv2d-126            [-1, 256, 8, 8]          33,024
      Bottleneck-127            [-1, 256, 8, 8]               0
     BatchNorm2d-128            [-1, 256, 8, 8]             512
            ReLU-129            [-1, 256, 8, 8]               0
          Conv2d-130            [-1, 128, 8, 8]          32,896
     BatchNorm2d-131            [-1, 128, 8, 8]             256
            ReLU-132            [-1, 128, 8, 8]               0
          Conv2d-133            [-1, 128, 8, 8]         147,584
     BatchNorm2d-134            [-1, 128, 8, 8]             256
            ReLU-135            [-1, 128, 8, 8]               0
          Conv2d-136            [-1, 256, 8, 8]          33,024
      Bottleneck-137            [-1, 256, 8, 8]               0
        Upsample-138          [-1, 256, 16, 16]               0
     BatchNorm2d-139          [-1, 256, 16, 16]             512
            ReLU-140          [-1, 256, 16, 16]               0
          Conv2d-141          [-1, 128, 16, 16]          32,896
     BatchNorm2d-142          [-1, 128, 16, 16]             256
            ReLU-143          [-1, 128, 16, 16]               0
          Conv2d-144          [-1, 128, 16, 16]         147,584
     BatchNorm2d-145          [-1, 128, 16, 16]             256
            ReLU-146          [-1, 128, 16, 16]               0
          Conv2d-147          [-1, 256, 16, 16]          33,024
      Bottleneck-148          [-1, 256, 16, 16]               0
        Upsample-149          [-1, 256, 32, 32]               0
     BatchNorm2d-150          [-1, 256, 32, 32]             512
            ReLU-151          [-1, 256, 32, 32]               0
          Conv2d-152          [-1, 128, 32, 32]          32,896
     BatchNorm2d-153          [-1, 128, 32, 32]             256
            ReLU-154          [-1, 128, 32, 32]               0
          Conv2d-155          [-1, 128, 32, 32]         147,584
     BatchNorm2d-156          [-1, 128, 32, 32]             256
            ReLU-157          [-1, 128, 32, 32]               0
          Conv2d-158          [-1, 256, 32, 32]          33,024
      Bottleneck-159          [-1, 256, 32, 32]               0
        Upsample-160          [-1, 256, 64, 64]               0
     BatchNorm2d-161          [-1, 256, 64, 64]             512
            ReLU-162          [-1, 256, 64, 64]               0
          Conv2d-163          [-1, 128, 64, 64]          32,896
     BatchNorm2d-164          [-1, 128, 64, 64]             256
            ReLU-165          [-1, 128, 64, 64]               0
          Conv2d-166          [-1, 128, 64, 64]         147,584
     BatchNorm2d-167          [-1, 128, 64, 64]             256
            ReLU-168          [-1, 128, 64, 64]               0
          Conv2d-169          [-1, 256, 64, 64]          33,024
      Bottleneck-170          [-1, 256, 64, 64]               0
        Upsample-171        [-1, 256, 128, 128]               0
       Hourglass-172        [-1, 256, 128, 128]               0
     BatchNorm2d-173        [-1, 256, 128, 128]             512
            ReLU-174        [-1, 256, 128, 128]               0
          Conv2d-175        [-1, 128, 128, 128]          32,896
     BatchNorm2d-176        [-1, 128, 128, 128]             256
            ReLU-177        [-1, 128, 128, 128]               0
          Conv2d-178        [-1, 128, 128, 128]         147,584
     BatchNorm2d-179        [-1, 128, 128, 128]             256
            ReLU-180        [-1, 128, 128, 128]               0
          Conv2d-181        [-1, 256, 128, 128]          33,024
      Bottleneck-182        [-1, 256, 128, 128]               0
          Conv2d-183        [-1, 256, 128, 128]          65,792
     BatchNorm2d-184        [-1, 256, 128, 128]             512
            ReLU-185        [-1, 256, 128, 128]               0
            ReLU-186        [-1, 256, 128, 128]               0
            ReLU-187        [-1, 256, 128, 128]               0
          Conv2d-188          [-1, 2, 128, 128]             514
          Conv2d-189        [-1, 256, 128, 128]          65,792
          Conv2d-190        [-1, 256, 128, 128]             768
     BatchNorm2d-191        [-1, 256, 128, 128]             512
            ReLU-192        [-1, 256, 128, 128]               0
          Conv2d-193        [-1, 128, 128, 128]          32,896
     BatchNorm2d-194        [-1, 128, 128, 128]             256
            ReLU-195        [-1, 128, 128, 128]               0
          Conv2d-196        [-1, 128, 128, 128]         147,584
     BatchNorm2d-197        [-1, 128, 128, 128]             256
            ReLU-198        [-1, 128, 128, 128]               0
          Conv2d-199        [-1, 256, 128, 128]          33,024
      Bottleneck-200        [-1, 256, 128, 128]               0
     BatchNorm2d-201          [-1, 256, 64, 64]             512
            ReLU-202          [-1, 256, 64, 64]               0
          Conv2d-203          [-1, 128, 64, 64]          32,896
     BatchNorm2d-204          [-1, 128, 64, 64]             256
            ReLU-205          [-1, 128, 64, 64]               0
          Conv2d-206          [-1, 128, 64, 64]         147,584
     BatchNorm2d-207          [-1, 128, 64, 64]             256
            ReLU-208          [-1, 128, 64, 64]               0
          Conv2d-209          [-1, 256, 64, 64]          33,024
      Bottleneck-210          [-1, 256, 64, 64]               0
     BatchNorm2d-211          [-1, 256, 64, 64]             512
            ReLU-212          [-1, 256, 64, 64]               0
          Conv2d-213          [-1, 128, 64, 64]          32,896
     BatchNorm2d-214          [-1, 128, 64, 64]             256
            ReLU-215          [-1, 128, 64, 64]               0
          Conv2d-216          [-1, 128, 64, 64]         147,584
     BatchNorm2d-217          [-1, 128, 64, 64]             256
            ReLU-218          [-1, 128, 64, 64]               0
          Conv2d-219          [-1, 256, 64, 64]          33,024
      Bottleneck-220          [-1, 256, 64, 64]               0
     BatchNorm2d-221          [-1, 256, 32, 32]             512
            ReLU-222          [-1, 256, 32, 32]               0
          Conv2d-223          [-1, 128, 32, 32]          32,896
     BatchNorm2d-224          [-1, 128, 32, 32]             256
            ReLU-225          [-1, 128, 32, 32]               0
          Conv2d-226          [-1, 128, 32, 32]         147,584
     BatchNorm2d-227          [-1, 128, 32, 32]             256
            ReLU-228          [-1, 128, 32, 32]               0
          Conv2d-229          [-1, 256, 32, 32]          33,024
      Bottleneck-230          [-1, 256, 32, 32]               0
     BatchNorm2d-231          [-1, 256, 32, 32]             512
            ReLU-232          [-1, 256, 32, 32]               0
          Conv2d-233          [-1, 128, 32, 32]          32,896
     BatchNorm2d-234          [-1, 128, 32, 32]             256
            ReLU-235          [-1, 128, 32, 32]               0
          Conv2d-236          [-1, 128, 32, 32]         147,584
     BatchNorm2d-237          [-1, 128, 32, 32]             256
            ReLU-238          [-1, 128, 32, 32]               0
          Conv2d-239          [-1, 256, 32, 32]          33,024
      Bottleneck-240          [-1, 256, 32, 32]               0
     BatchNorm2d-241          [-1, 256, 16, 16]             512
            ReLU-242          [-1, 256, 16, 16]               0
          Conv2d-243          [-1, 128, 16, 16]          32,896
     BatchNorm2d-244          [-1, 128, 16, 16]             256
            ReLU-245          [-1, 128, 16, 16]               0
          Conv2d-246          [-1, 128, 16, 16]         147,584
     BatchNorm2d-247          [-1, 128, 16, 16]             256
            ReLU-248          [-1, 128, 16, 16]               0
          Conv2d-249          [-1, 256, 16, 16]          33,024
      Bottleneck-250          [-1, 256, 16, 16]               0
     BatchNorm2d-251          [-1, 256, 16, 16]             512
            ReLU-252          [-1, 256, 16, 16]               0
          Conv2d-253          [-1, 128, 16, 16]          32,896
     BatchNorm2d-254          [-1, 128, 16, 16]             256
            ReLU-255          [-1, 128, 16, 16]               0
          Conv2d-256          [-1, 128, 16, 16]         147,584
     BatchNorm2d-257          [-1, 128, 16, 16]             256
            ReLU-258          [-1, 128, 16, 16]               0
          Conv2d-259          [-1, 256, 16, 16]          33,024
      Bottleneck-260          [-1, 256, 16, 16]               0
     BatchNorm2d-261            [-1, 256, 8, 8]             512
            ReLU-262            [-1, 256, 8, 8]               0
          Conv2d-263            [-1, 128, 8, 8]          32,896
     BatchNorm2d-264            [-1, 128, 8, 8]             256
            ReLU-265            [-1, 128, 8, 8]               0
          Conv2d-266            [-1, 128, 8, 8]         147,584
     BatchNorm2d-267            [-1, 128, 8, 8]             256
            ReLU-268            [-1, 128, 8, 8]               0
          Conv2d-269            [-1, 256, 8, 8]          33,024
      Bottleneck-270            [-1, 256, 8, 8]               0
     BatchNorm2d-271            [-1, 256, 8, 8]             512
            ReLU-272            [-1, 256, 8, 8]               0
          Conv2d-273            [-1, 128, 8, 8]          32,896
     BatchNorm2d-274            [-1, 128, 8, 8]             256
            ReLU-275            [-1, 128, 8, 8]               0
          Conv2d-276            [-1, 128, 8, 8]         147,584
     BatchNorm2d-277            [-1, 128, 8, 8]             256
            ReLU-278            [-1, 128, 8, 8]               0
          Conv2d-279            [-1, 256, 8, 8]          33,024
      Bottleneck-280            [-1, 256, 8, 8]               0
     BatchNorm2d-281            [-1, 256, 8, 8]             512
            ReLU-282            [-1, 256, 8, 8]               0
          Conv2d-283            [-1, 128, 8, 8]          32,896
     BatchNorm2d-284            [-1, 128, 8, 8]             256
            ReLU-285            [-1, 128, 8, 8]               0
          Conv2d-286            [-1, 128, 8, 8]         147,584
     BatchNorm2d-287            [-1, 128, 8, 8]             256
            ReLU-288            [-1, 128, 8, 8]               0
          Conv2d-289            [-1, 256, 8, 8]          33,024
      Bottleneck-290            [-1, 256, 8, 8]               0
        Upsample-291          [-1, 256, 16, 16]               0
     BatchNorm2d-292          [-1, 256, 16, 16]             512
            ReLU-293          [-1, 256, 16, 16]               0
          Conv2d-294          [-1, 128, 16, 16]          32,896
     BatchNorm2d-295          [-1, 128, 16, 16]             256
            ReLU-296          [-1, 128, 16, 16]               0
          Conv2d-297          [-1, 128, 16, 16]         147,584
     BatchNorm2d-298          [-1, 128, 16, 16]             256
            ReLU-299          [-1, 128, 16, 16]               0
          Conv2d-300          [-1, 256, 16, 16]          33,024
      Bottleneck-301          [-1, 256, 16, 16]               0
        Upsample-302          [-1, 256, 32, 32]               0
     BatchNorm2d-303          [-1, 256, 32, 32]             512
            ReLU-304          [-1, 256, 32, 32]               0
          Conv2d-305          [-1, 128, 32, 32]          32,896
     BatchNorm2d-306          [-1, 128, 32, 32]             256
            ReLU-307          [-1, 128, 32, 32]               0
          Conv2d-308          [-1, 128, 32, 32]         147,584
     BatchNorm2d-309          [-1, 128, 32, 32]             256
            ReLU-310          [-1, 128, 32, 32]               0
          Conv2d-311          [-1, 256, 32, 32]          33,024
      Bottleneck-312          [-1, 256, 32, 32]               0
        Upsample-313          [-1, 256, 64, 64]               0
     BatchNorm2d-314          [-1, 256, 64, 64]             512
            ReLU-315          [-1, 256, 64, 64]               0
          Conv2d-316          [-1, 128, 64, 64]          32,896
     BatchNorm2d-317          [-1, 128, 64, 64]             256
            ReLU-318          [-1, 128, 64, 64]               0
          Conv2d-319          [-1, 128, 64, 64]         147,584
     BatchNorm2d-320          [-1, 128, 64, 64]             256
            ReLU-321          [-1, 128, 64, 64]               0
          Conv2d-322          [-1, 256, 64, 64]          33,024
      Bottleneck-323          [-1, 256, 64, 64]               0
        Upsample-324        [-1, 256, 128, 128]               0
       Hourglass-325        [-1, 256, 128, 128]               0
     BatchNorm2d-326        [-1, 256, 128, 128]             512
            ReLU-327        [-1, 256, 128, 128]               0
          Conv2d-328        [-1, 128, 128, 128]          32,896
     BatchNorm2d-329        [-1, 128, 128, 128]             256
            ReLU-330        [-1, 128, 128, 128]               0
          Conv2d-331        [-1, 128, 128, 128]         147,584
     BatchNorm2d-332        [-1, 128, 128, 128]             256
            ReLU-333        [-1, 128, 128, 128]               0
          Conv2d-334        [-1, 256, 128, 128]          33,024
      Bottleneck-335        [-1, 256, 128, 128]               0
          Conv2d-336        [-1, 256, 128, 128]          65,792
     BatchNorm2d-337        [-1, 256, 128, 128]             512
            ReLU-338        [-1, 256, 128, 128]               0
            ReLU-339        [-1, 256, 128, 128]               0
            ReLU-340        [-1, 256, 128, 128]               0
          Conv2d-341          [-1, 2, 128, 128]             514

================================================================
Total params: 6,720,132
Trainable params: 6,720,132
Non-trainable params: 0
----------------------------------------------------------------

