----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,408
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5           [-1, 64, 56, 56]          36,864
       BatchNorm2d-6           [-1, 64, 56, 56]             128
              ReLU-7           [-1, 64, 56, 56]               0
            Conv2d-8           [-1, 64, 56, 56]          36,864
       BatchNorm2d-9           [-1, 64, 56, 56]             128
             ReLU-10           [-1, 64, 56, 56]               0
       BasicBlock-11           [-1, 64, 56, 56]               0
           Conv2d-12           [-1, 64, 56, 56]          36,864
      BatchNorm2d-13           [-1, 64, 56, 56]             128
             ReLU-14           [-1, 64, 56, 56]               0
           Conv2d-15           [-1, 64, 56, 56]          36,864
      BatchNorm2d-16           [-1, 64, 56, 56]             128
             ReLU-17           [-1, 64, 56, 56]               0
       BasicBlock-18           [-1, 64, 56, 56]               0
           Conv2d-19          [-1, 128, 28, 28]          73,728
      BatchNorm2d-20          [-1, 128, 28, 28]             256
             ReLU-21          [-1, 128, 28, 28]               0
           Conv2d-22          [-1, 128, 28, 28]         147,456
      BatchNorm2d-23          [-1, 128, 28, 28]             256
           Conv2d-24          [-1, 128, 28, 28]           8,192
      BatchNorm2d-25          [-1, 128, 28, 28]             256
             ReLU-26          [-1, 128, 28, 28]               0
       BasicBlock-27          [-1, 128, 28, 28]               0
           Conv2d-28          [-1, 128, 28, 28]         147,456
      BatchNorm2d-29          [-1, 128, 28, 28]             256
             ReLU-30          [-1, 128, 28, 28]               0
           Conv2d-31          [-1, 128, 28, 28]         147,456
      BatchNorm2d-32          [-1, 128, 28, 28]             256
             ReLU-33          [-1, 128, 28, 28]               0
       BasicBlock-34          [-1, 128, 28, 28]               0
           Conv2d-35          [-1, 256, 14, 14]         294,912
      BatchNorm2d-36          [-1, 256, 14, 14]             512
             ReLU-37          [-1, 256, 14, 14]               0
           Conv2d-38          [-1, 256, 14, 14]         589,824
      BatchNorm2d-39          [-1, 256, 14, 14]             512
           Conv2d-40          [-1, 256, 14, 14]          32,768
      BatchNorm2d-41          [-1, 256, 14, 14]             512
             ReLU-42          [-1, 256, 14, 14]               0
       BasicBlock-43          [-1, 256, 14, 14]               0
           Conv2d-44          [-1, 256, 14, 14]         589,824
      BatchNorm2d-45          [-1, 256, 14, 14]             512
             ReLU-46          [-1, 256, 14, 14]               0
           Conv2d-47          [-1, 256, 14, 14]         589,824
      BatchNorm2d-48          [-1, 256, 14, 14]             512
             ReLU-49          [-1, 256, 14, 14]               0
       BasicBlock-50          [-1, 256, 14, 14]               0
           Conv2d-51            [-1, 512, 7, 7]       1,179,648
      BatchNorm2d-52            [-1, 512, 7, 7]           1,024
             ReLU-53            [-1, 512, 7, 7]               0
           Conv2d-54            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-55            [-1, 512, 7, 7]           1,024
           Conv2d-56            [-1, 512, 7, 7]         131,072
      BatchNorm2d-57            [-1, 512, 7, 7]           1,024
             ReLU-58            [-1, 512, 7, 7]               0
       BasicBlock-59            [-1, 512, 7, 7]               0
           Conv2d-60            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-61            [-1, 512, 7, 7]           1,024
             ReLU-62            [-1, 512, 7, 7]               0
           Conv2d-63            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-64            [-1, 512, 7, 7]           1,024
             ReLU-65            [-1, 512, 7, 7]               0
       BasicBlock-66            [-1, 512, 7, 7]               0
           Conv2d-67            [-1, 128, 7, 7]          65,536
      BatchNorm2d-68            [-1, 128, 7, 7]             256
             ReLU-69            [-1, 128, 7, 7]               0
  ConvTranspose2d-70          [-1, 128, 14, 14]         147,456
      BatchNorm2d-71          [-1, 128, 14, 14]             256
             ReLU-72          [-1, 128, 14, 14]               0
           Conv2d-73          [-1, 256, 14, 14]          32,768
      BatchNorm2d-74          [-1, 256, 14, 14]             512
             ReLU-75          [-1, 256, 14, 14]               0
          Decoder-76          [-1, 256, 14, 14]               0
           Conv2d-77           [-1, 64, 14, 14]          16,384
      BatchNorm2d-78           [-1, 64, 14, 14]             128
             ReLU-79           [-1, 64, 14, 14]               0
  ConvTranspose2d-80           [-1, 64, 28, 28]          36,864
      BatchNorm2d-81           [-1, 64, 28, 28]             128
             ReLU-82           [-1, 64, 28, 28]               0
           Conv2d-83          [-1, 128, 28, 28]           8,192
      BatchNorm2d-84          [-1, 128, 28, 28]             256
             ReLU-85          [-1, 128, 28, 28]               0
          Decoder-86          [-1, 128, 28, 28]               0
           Conv2d-87           [-1, 32, 28, 28]           4,096
      BatchNorm2d-88           [-1, 32, 28, 28]              64
             ReLU-89           [-1, 32, 28, 28]               0
  ConvTranspose2d-90           [-1, 32, 56, 56]           9,216
      BatchNorm2d-91           [-1, 32, 56, 56]              64
             ReLU-92           [-1, 32, 56, 56]               0
           Conv2d-93           [-1, 64, 56, 56]           2,048
      BatchNorm2d-94           [-1, 64, 56, 56]             128
             ReLU-95           [-1, 64, 56, 56]               0
          Decoder-96           [-1, 64, 56, 56]               0
           Conv2d-97           [-1, 16, 56, 56]           1,024
      BatchNorm2d-98           [-1, 16, 56, 56]              32
             ReLU-99           [-1, 16, 56, 56]               0
 ConvTranspose2d-100           [-1, 16, 56, 56]           2,304
     BatchNorm2d-101           [-1, 16, 56, 56]              32
            ReLU-102           [-1, 16, 56, 56]               0
          Conv2d-103           [-1, 64, 56, 56]           1,024
     BatchNorm2d-104           [-1, 64, 56, 56]             128
            ReLU-105           [-1, 64, 56, 56]               0
         Decoder-106           [-1, 64, 56, 56]               0
 ConvTranspose2d-107         [-1, 32, 112, 112]          18,464
     BatchNorm2d-108         [-1, 32, 112, 112]              64
            ReLU-109         [-1, 32, 112, 112]               0
          Conv2d-110         [-1, 32, 112, 112]           9,248
     BatchNorm2d-111         [-1, 32, 112, 112]              64
            ReLU-112         [-1, 32, 112, 112]               0
 ConvTranspose2d-113         [-1, 10, 224, 224]           1,290
      LogSoftmax-114         [-1, 10, 224, 224]               0

================================================================
Total params: 11,534,538
Trainable params: 11,534,538
Non-trainable params: 0
----------------------------------------------------------------

----------------------------------------------------------------


