----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]           1,792
       BatchNorm2d-2         [-1, 64, 224, 224]             128
            Conv2d-3         [-1, 64, 224, 224]          36,928
       BatchNorm2d-4         [-1, 64, 224, 224]             128
         MaxPool2d-5  [[-1, 64, 112, 112], [-1, 64, 112, 112]]               0
            Conv2d-6        [-1, 128, 112, 112]          73,856
       BatchNorm2d-7        [-1, 128, 112, 112]             256
            Conv2d-8        [-1, 128, 112, 112]         147,584
       BatchNorm2d-9        [-1, 128, 112, 112]             256
        MaxPool2d-10  [[-1, 128, 56, 56], [-1, 128, 56, 56]]               0
           Conv2d-11          [-1, 256, 56, 56]         295,168
      BatchNorm2d-12          [-1, 256, 56, 56]             512
           Conv2d-13          [-1, 256, 56, 56]         590,080
      BatchNorm2d-14          [-1, 256, 56, 56]             512
           Conv2d-15          [-1, 256, 56, 56]         590,080
      BatchNorm2d-16          [-1, 256, 56, 56]             512
        MaxPool2d-17  [[-1, 256, 28, 28], [-1, 256, 28, 28]]               0
           Conv2d-18          [-1, 512, 28, 28]       1,180,160
      BatchNorm2d-19          [-1, 512, 28, 28]           1,024
           Conv2d-20          [-1, 512, 28, 28]       2,359,808
      BatchNorm2d-21          [-1, 512, 28, 28]           1,024
           Conv2d-22          [-1, 512, 28, 28]       2,359,808
      BatchNorm2d-23          [-1, 512, 28, 28]           1,024
        MaxPool2d-24  [[-1, 512, 14, 14], [-1, 512, 14, 14]]               0
           Conv2d-25          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-26          [-1, 512, 14, 14]           1,024
           Conv2d-27          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-28          [-1, 512, 14, 14]           1,024
           Conv2d-29          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-30          [-1, 512, 14, 14]           1,024
        MaxPool2d-31  [[-1, 512, 7, 7], [-1, 512, 7, 7]]               0
      MaxUnpool2d-32          [-1, 512, 14, 14]               0
           Conv2d-33          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-34          [-1, 512, 14, 14]           1,024
           Conv2d-35          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-36          [-1, 512, 14, 14]           1,024
           Conv2d-37          [-1, 512, 14, 14]       2,359,808
      BatchNorm2d-38          [-1, 512, 14, 14]           1,024
      MaxUnpool2d-39          [-1, 512, 28, 28]               0
           Conv2d-40          [-1, 512, 28, 28]       2,359,808
      BatchNorm2d-41          [-1, 512, 28, 28]           1,024
           Conv2d-42          [-1, 512, 28, 28]       2,359,808
      BatchNorm2d-43          [-1, 512, 28, 28]           1,024
           Conv2d-44          [-1, 256, 28, 28]       1,179,904
      BatchNorm2d-45          [-1, 256, 28, 28]             512
      MaxUnpool2d-46          [-1, 256, 56, 56]               0
           Conv2d-47          [-1, 256, 56, 56]         590,080
      BatchNorm2d-48          [-1, 256, 56, 56]             512
           Conv2d-49          [-1, 256, 56, 56]         590,080
      BatchNorm2d-50          [-1, 256, 56, 56]             512
           Conv2d-51          [-1, 128, 56, 56]         295,040
      BatchNorm2d-52          [-1, 128, 56, 56]             256
      MaxUnpool2d-53        [-1, 128, 112, 112]               0
           Conv2d-54        [-1, 128, 112, 112]         147,584
      BatchNorm2d-55        [-1, 128, 112, 112]             256
           Conv2d-56         [-1, 64, 112, 112]          73,792
      BatchNorm2d-57         [-1, 64, 112, 112]             128
      MaxUnpool2d-58         [-1, 64, 224, 224]               0
           Conv2d-59         [-1, 64, 224, 224]          36,928
      BatchNorm2d-60         [-1, 64, 224, 224]             128
           Conv2d-61        [-1, 224, 224, 224]         129,248

================================================================
Total params: 29,572,256
Trainable params: 29,572,256
Non-trainable params: 0
----------------------------------------------------------------

